{
  "title": "IFrame Checker",
  "description": "Check if a website can be embedded in an iframe",
  "urlPlaceholder": "Enter website URL (e.g., https://example.com)",
  "checkButton": "Check Website",
  "checking": "Checking...",
  "iframeResult": "IFrame Result",
  "invalidUrl": "Please enter a valid URL starting with http:// or https://",
  "accessDenied": "Website blocked iframe embedding.",
  "loadError": "Failed to load the website.",
  "timeoutError": "Request timed out. The website took too long to respond.",
  "connectionRefused": "Connection refused by the website.",
  "connectionRefusedDetail": "The website actively refused the connection attempt. This usually means the site has security measures preventing iframe embedding.",
  "loading": "Loading...",
  "loadSuccess": "Successfully loaded",
  "loadTimeout": "Loading timed out",
  "blocked": "Embedding blocked",
  "failed": "Failed to load",
  "openInNewTab": "Open in new tab",
  "footer": "Test any website's iframe compatibility instantly",
  "copyright": "All rights reserved. Built with ❤️ for web developers worldwide.",
  "securityError": "This is likely due to X-Frame-Options or Content Security Policy restrictions.",
  "emptyResponse": "The website returned an empty response, possibly blocking the embed.",
  "blockedRedirect": "The website redirected to a blocked page.",
  "networkError": "There might be network connectivity issues or the site might be unavailable.",
  "unknownError": "An unknown error occurred while trying to embed the website.",
  "howToUseTitle": "How to Use",
  "howToUseStep1": "Enter the URL of the target website in the input box.",
  "howToUseStep2": "Click the \"Check\" button.",
  "howToUseStep3": "View the target website's content below or receive a message explaining why embedding is not allowed.",
  "whatIsIframeTitle": "What is an iframe?",
  "whatIsIframeContent": "An iframe (inline frame) is an HTML element that allows embedding another HTML page within a parent page. It's widely used for displaying external content, such as videos or widgets, within a webpage.",
  "howToUseHtmlTitle": "How to Use iframes in HTML",
  "howToUseHtmlContent": "To embed a webpage using an iframe in HTML:",
  "whyBlockedTitle": "Why Some Websites Block iframes",
  "whyBlockedContent": "Some websites cannot be embedded in iframes due to security measures like X-Frame-Options or Content-Security-Policy. These headers protect against clickjacking and other vulnerabilities.",
  "aboutTitle": "About IFrame Checker",
  "aboutContent": "IFrame Checker helps users test if a website can be embedded using an iframe. Whether you're a developer or simply curious, our tool provides instant results and helpful insights about iframe compatibility.",
  "codeExamples": "Code Examples"
}